app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "beyond all issues... the light will shine again"], ["created_at", "2014-08-24 02:13:32.384476"], ["title", "And the sun is shining"], ["updated_at", "2014-08-24 02:13:32.384476"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save